docs/waystart.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-21 Fri 16:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Wayland start graphics ui</title>
<meta name="author" content="Pradyumna Paranjape" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Wayland start graphics ui</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1ed5ef7">Description</a></li>
<li><a href="#org55b26f7">Code</a>
<ul>
<li><a href="#orge99daee">Header</a></li>
<li><a href="#org1a21264">Variables</a></li>
<li><a href="#org4ecd132">Parse command line arguments</a></li>
<li><a href="#org98530ba">Parse files</a></li>
<li><a href="#org5b60bbc">Launch</a></li>
<li><a href="#org3f40be6">Entry-Point</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1ed5ef7" class="outline-2">
<h2 id="org1ed5ef7">Description</h2>
<div class="outline-text-2" id="text-org1ed5ef7">
<p>
Start wayland similar to startx.
</p>
</div>
</div>

<div id="outline-container-org55b26f7" class="outline-2">
<h2 id="org55b26f7">Code</h2>
<div class="outline-text-2" id="text-org55b26f7">
</div>
<div id="outline-container-orge99daee" class="outline-3">
<h3 id="orge99daee">Header</h3>
<div class="outline-text-3" id="text-orge99daee">
<p>
This section tangles the code (POSIX)
</p>
</div>
</div>
<div id="outline-container-org1a21264" class="outline-3">
<h3 id="org1a21264">Variables</h3>
<div class="outline-text-3" id="text-org1a21264">
<p>
With dbus-run-session under wayland, we don&rsquo;t define DISPLAY
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Set clean variables before running script.</span>
<span class="org-function-name">set_vars</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-builtin">unset</span> DBUS_SESSION_BUS_ADDRESS
    <span class="org-builtin">unset</span> SESSION_MANAGER
    <span class="org-comment-delimiter"># </span><span class="org-comment">Hopefully, following X11's rc</span>
    <span class="org-variable-name">client</span>=
    <span class="org-variable-name">userclientrc</span>=<span class="org-string">"${HOME}/.wayinitrc"</span>
    <span class="org-variable-name">sysclientrc</span>=<span class="org-string">"/etc/wayland/wayinit/wayinitrc"</span>
    <span class="org-variable-name">defaultclientargs</span>=
    <span class="org-variable-name">clientargs</span>=
    <span class="org-variable-name">exec_cmd</span>=
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4ecd132" class="outline-3">
<h3 id="org4ecd132">Parse command line arguments</h3>
<div class="outline-text-3" id="text-org4ecd132">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Parse command line arguments</span>
<span class="org-function-name">cli_args</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">while</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"$1"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">do</span>
        <span class="org-keyword">case</span> <span class="org-string">"$1"</span><span class="org-keyword"> in</span>
            --)
                printf <span class="org-string">"Wayland doesn't run an xserver. "</span> &gt;&amp;2
                printf <span class="org-string">"Ignoring server-args.\n"</span> &gt;&amp;2
                <span class="org-keyword">break</span>
                ;;
            *)
                <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -z <span class="org-string">"${client}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
                    <span class="org-variable-name">client</span>=<span class="org-string">"${1}"</span>
                <span class="org-keyword">else</span>
                    <span class="org-variable-name">clientargs</span>=<span class="org-string">"${clientargs} ${1}"</span>
                <span class="org-keyword">fi</span>
                ;;
        <span class="org-keyword">esac</span>
        <span class="org-builtin">shift</span>
    <span class="org-keyword">done</span>

    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -z <span class="org-string">"${client}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -f <span class="org-string">"${userclientrc}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
            <span class="org-variable-name">client</span>=<span class="org-string">"${userclientrc}"</span>
        <span class="org-keyword">elif</span> <span class="org-rainbow-delimiters-depth-2">[</span> -f <span class="org-string">"${sysclientrc}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
            <span class="org-variable-name">client</span>=<span class="org-string">"${sysclientrc}"</span>
        <span class="org-keyword">fi</span>
    <span class="org-keyword">fi</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">if no client arguments, use defaults</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -z <span class="org-string">"$clientargs"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">clientargs</span>=<span class="org-string">"${defaultclientargs}"</span>
    <span class="org-keyword">fi</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org98530ba" class="outline-3">
<h3 id="org98530ba">Parse files</h3>
<div class="outline-text-3" id="text-org98530ba">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Extract "what to exec" from &lt;client&gt;.desktop file</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Args:</span>
<span class="org-comment-delimiter">#    </span><span class="org-comment">$1: selected client</span>
<span class="org-function-name">parse_desktop_entry</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-variable-name">client</span>=<span class="org-string">"${1}"</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-negation-char">!</span> -f <span class="org-string">"${client}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"$(dirname "${client}")"</span> = <span class="org-string">'.'</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
            <span class="org-variable-name">client</span>=<span class="org-string">"/usr/share/wayland-sessions/${client}"</span>
        <span class="org-keyword">else</span>
            <span class="org-builtin">echo</span> <span class="org-string">"Bad wayland session: ${client}."</span> &gt;&amp;2
            <span class="org-keyword">exit</span> 1
        <span class="org-keyword">fi</span>
    <span class="org-keyword">fi</span>
    <span class="org-variable-name">exec_line</span>=<span class="org-string">"$(grep -i "^exec" "${client}" | head -1)"</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -z <span class="org-string">"${exec_line}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">exec_line</span>=<span class="org-string">"$(grep -i "^tryexec" "${client}" | head -1)"</span>
    <span class="org-keyword">fi</span>
    <span class="org-variable-name">exec_cmd</span>=<span class="org-string">"${exec_line#*=}"</span>
    <span class="org-builtin">unset</span> desk_line
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">parse inittc to decide how to execute it.</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Args:</span>
<span class="org-comment-delimiter">#    </span><span class="org-comment">$1: desktop file.</span>
<span class="org-function-name">parse_initrc</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">$1 wayinitrc file path</span>
    <span class="org-variable-name">file_is_exec</span>=true
    <span class="org-keyword">while </span><span class="org-builtin">read</span> -r init_line; <span class="org-keyword">do</span>
        <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-negation-char">!</span> <span class="org-string">"${init_line%.desktop}"</span> = <span class="org-string">"${init_line}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
            <span class="org-variable-name">file_is_exec</span>=false
            parse_desktop_entry <span class="org-string">"${init_line}"</span>
            <span class="org-keyword">break</span>
        <span class="org-keyword">fi</span>
    <span class="org-keyword">done</span>&lt;<span class="org-string">"${1}"</span>
    <span class="org-keyword">if</span> $<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-variable-name">file_is_exec</span><span class="org-rainbow-delimiters-depth-2">}</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">exec_cmd</span>=<span class="org-string">"sh ${1}"</span>
    <span class="org-keyword">fi</span>
    <span class="org-builtin">unset</span> file_is_exec
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5b60bbc" class="outline-3">
<h3 id="org5b60bbc">Launch</h3>
<div class="outline-text-3" id="text-org5b60bbc">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-function-name">parse_client</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">if </span><span class="org-builtin">builtin</span> command -v <span class="org-string">"${client}"</span> &gt;/dev/null 2&gt;&amp;1 <span class="org-sh-escaped-newline">\</span>
           || <span class="org-rainbow-delimiters-depth-2">[</span> -x <span class="org-string">"${client}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">exec_cmd</span>=<span class="org-string">"${client}"</span>
    <span class="org-keyword">elif</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-negation-char">!</span> <span class="org-string">"${client%.desktop}"</span> = <span class="org-string">"${client}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        parse_desktop_entry <span class="org-string">"${client}"</span>
    <span class="org-keyword">else</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">parse it to locate .desktop entry if available</span>
        parse_initrc <span class="org-string">"${client}"</span>
    <span class="org-keyword">fi</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -z <span class="org-string">"${exec_cmd}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> <span class="org-string">"Couldn't find session executable for ${client}."</span>
        <span class="org-keyword">exit</span> 1
    <span class="org-keyword">fi</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-function-name">clean_up</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-builtin">unset</span> client
    <span class="org-builtin">unset</span> userclientrc
    <span class="org-builtin">unset</span> sysclientrc
    <span class="org-builtin">unset</span> defaultclientargs
    <span class="org-builtin">unset</span> clientargs
    <span class="org-builtin">unset</span> exec_cmd

    <span class="org-keyword">if </span><span class="org-builtin">builtin</span> command -v deallocvt &gt; /dev/null 2&gt;&amp;1; <span class="org-keyword">then</span>
        deallocvt
    <span class="org-keyword">fi</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3f40be6" class="outline-3">
<h3 id="org3f40be6">Entry-Point</h3>
<div class="outline-text-3" id="text-org3f40be6">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Main routine call</span>
<span class="org-function-name">main</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    set_vars
    cli_args <span class="org-string">"$@"</span>
    parse_client
    <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC2086</span>
    dbus-run-session $<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-variable-name">exec_cmd</span><span class="org-rainbow-delimiters-depth-2">}</span> $<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-variable-name">clientargs</span><span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-variable-name">exit_code</span>=$<span class="org-variable-name">?</span>
    clean_up
    <span class="org-keyword">exit</span> $<span class="org-variable-name">exit_code</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

main <span class="org-string">"$@"</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>